Бухгалтерия_обновление_тест1/src/Catalogs/СпособыОтраженияЗарплатыВБухУчете/СпособыОтраженияЗарплатыВБухУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпособыОтраженияЗарплатыВБухУчете</name>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимУчетаВзносов</name>
    <comment>0 - совпадает с зарплатй, 1 - все взносы на отдельной статье</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПрочиеОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовВзносов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовВзносов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивовВзносов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВзносов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1Взносов</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2Взносов</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3Взносов</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаСдельныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтдельнаяСтатьяКалькуляции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтдельнаяСтатьяКалькуляцииВзносов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляцииВзносов</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаРаспределенияПоСдельнымРаботам</name>
    <type>
      <types>EnumRef.ТипыБазыРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Бухгалтерия_обновление_тест1/src/Catalogs/СпособыОтраженияЗарплатыВБухУчете/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ПараметрыВыбораСтатейИАналитик = Справочники.СпособыОтраженияЗарплатыВБухУчете.ПараметрыВыбораСтатейИАналитик();
	ДоходыИРасходыСервер.ОбработкаЗаполнения(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НеИспользуемыеРеквизиты = Справочники.СпособыОтраженияЗарплатыВБухУчете.НеИспользуемыеРеквизиты(ЭтотОбъект);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(
		ПроверяемыеРеквизиты,
		НеИспользуемыеРеквизиты);
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ПодбираемыеАналитики = Справочники.СпособыОтраженияЗарплатыВБухУчете.ПодбираемыеАналитики();
	
	Если ПодбираемыеАналитики.Найти(ТипЗнч(АналитикаРасходов)) <> Неопределено Тогда
		МассивНепроверяемыхРеквизитов.Добавить("АналитикаРасходов");
	КонецЕсли;
		
	Если ПодбираемыеАналитики.Найти(ТипЗнч(АналитикаРасходовВзносов)) <> Неопределено Тогда
		МассивНепроверяемыхРеквизитов.Добавить("АналитикаРасходовВзносов");
	КонецЕсли;
		
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(
		ПроверяемыеРеквизиты,
		МассивНепроверяемыхРеквизитов);
	
	ПараметрыВыбораСтатейИАналитик = Справочники.СпособыОтраженияЗарплатыВБухУчете.ПараметрыВыбораСтатейИАналитик();
	ДоходыИРасходыСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, ПараметрыВыбораСтатейИАналитик);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ЕстьПрочиеОперации = Справочники.СпособыОтраженияЗарплатыВБухУчете.ОтражениеПрочихОпераций(ЭтотОбъект);
	
	// очистка неиспользуемых реквизитов
	НеИспользуемыеРеквизиты = Справочники.СпособыОтраженияЗарплатыВБухУчете.НеИспользуемыеРеквизиты(ЭтотОбъект);
	
	Для Каждого Реквизит Из НеИспользуемыеРеквизиты Цикл
		ЭтотОбъект[Реквизит] = Неопределено;
	КонецЦикла;
	
	ПараметрыВыбораСтатейИАналитик = Справочники.СпособыОтраженияЗарплатыВБухУчете.ПараметрыВыбораСтатейИАналитик();
	ДоходыИРасходыСервер.ПередЗаписью(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
	// установка значений по умолчанию
	Если Не ЗначениеЗаполнено(БазаРаспределенияПоСдельнымРаботам) Тогда
		БазаРаспределенияПоСдельнымРаботам = Перечисления.ТипыБазыРаспределенияРасходов.НормативыОплатыТруда;
	КонецЕсли;
	
	Если РежимУчетаВзносов = 0 Тогда
		СтатьяРасходовВзносов = СтатьяРасходов;
		АналитикаРасходовВзносов = АналитикаРасходов;
		АналитикаАктивовПассивовВзносов = АналитикаАктивовПассивов;
		СчетУчетаВзносов = СчетУчета;
		Субконто1Взносов = Субконто1;
		Субконто2Взносов = Субконто2;
		Субконто3Взносов = Субконто3;
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
